[{"type":1,"nodes":2},"data",[3,4],null,{"type":1,"data":5,"uses":38},{"project":6,"projectContent":24},{"title":7,"tagLine":8,"summary":9,"featuredImage":10,"slug":13,"startDate":14,"endDate":15,"tags":16,"contributors":20},"Fruitful Spaces","Hydroponic vegetables grown in underused office space","Employees are demanding more from their office spaces while being there less. Fruitful spaces aims to bring a stronger sense of community while tackling food mileage by growing food and herbs in underutilised office spaces. This IoT enabled hydroponic system produces anything from herbs to full tomatoes to spicy chillis.",{"src":11,"alt":12},"\u002Fmedia\u002Ffruitful\u002Ffruitful.webp","A small plant in a Fruitful Unit","fruitful-spaces","09\u002F09\u002F2021","17\u002F06\u002F2022",[17,18,19],"Start up","Internet of Things","Hydroponics",[21,22,23],"Chris Vail","Abi Langbridge","Matt Ryan",[25,29,32,35],{"component":26,"props":27},"paragraph",{"content":28},"Fruitful is a cutting-edge hydroponics system designed to help employees in office spaces connect with each other through the shared experience of growing delicious, nutritious food. The system is modular, which means that it can be customized to fit any workspace, and it's also incredibly easy to use, with an intuitive interface that guides users through the growing process.",{"component":26,"props":30},{"content":31},"One of the most impressive features of Fruitful is its autonomy. Unlike traditional hydroponics systems, Fruitful is designed to be virtually self-sustaining, so even if you forget about it for a few weeks, your plants won't suffer. However, the system also helps users stay up to date with their plants' needs, sending reminders when it's time to add water or nutrients.",{"component":26,"props":33},{"content":34},"Fruitful is a perfect solution for companies that want to promote sustainability, health, and wellness among their employees. By providing a fun and easy way for employees to grow their own food, Fruitful encourages a sense of community and collaboration, while also promoting healthy eating habits and reducing carbon emissions associated with food transportation.",{"component":26,"props":36},{"content":37},"Overall, Fruitful is an impressive example of the intersection between technology and sustainability. With its modular design, autonomous features, and emphasis on community building, Fruitful is poised to revolutionize the way we think about hydroponics and workplace wellness.",{"dependencies":-1,"params":39,"parent":-1,"url":-1},[40],"slug"]