[{"type":1,"nodes":2},"data",[3,4],null,{"type":1,"data":5,"uses":35},{"project":6,"projectContent":21},{"title":7,"tagLine":8,"summary":9,"featuredImage":10,"slug":13,"startDate":14,"endDate":15,"tags":16,"contributors":19},"3D Facial Reconstruction","Digitising faces using an iPhone camera","At Polymetrix, I'm working towards a system to capture highly accurate 3D scans of individuals faces using the iPhone's TrueDepth camera. With 0.5mm precision required, minimal libraries and limited compute resources, how can we convert depth images into 3D models that can be used to fit custom masks?",{"src":11,"alt":12},"\u002Fmedia\u002Fface_reconstruction\u002Fface_reconstruction.webp","3D model of my face","3d-facial-reconstruction","09\u002F09\u002F2019","15\u002F01\u002F2020",[17,18],"Python","Data Structures and Algorithms",[20],"Chris Vail",[22,26,29,32],{"component":23,"props":24},"paragraph",{"content":25},"I'm currently working as the core developer for an exciting pre-seed startup called PolyMetrix, which has developed a cutting-edge system for mass-customizing products based on a 3D model of the user's body. With only 3 people on the team, it's been an amazing opportunity to be involved in the development of a company from the very beginning.",{"component":23,"props":27},{"content":28},"PolyMetrix's system has the potential to revolutionize the way we approach mass-customization of products. By using a 3D model of the user's body, PolyMetrix can produce custom-fit products that are comfortable, efficient, and effective. With my expertise in developing high-performance code, I've been able to contribute to this exciting and innovative project, helping to make it a reality.",{"component":23,"props":30},{"content":31},"One of the biggest challenges in developing this was creating a system that could align depth images taken of people's faces quickly and accurately, all while running on an iPhone - a notably resource-restricted environment for this type of work. To meet this challenge, I developed a high-performance algorithm that uses state-of-the-art techniques for aligning depth images, while also optimizing the code to run efficiently on an iPhone",{"component":23,"props":33},{"content":34},"I'm incredibly proud to be working with PolyMetrix and its founders, who are all passionate and committed to bringing their vision to life, while exploring the cutting-edge of technology and innovation. With such a talented and driven team, I'm excited to see where this startup goes in the future.",{"dependencies":-1,"params":36,"parent":-1,"url":-1},[37],"slug"]